Catalogs/КонтролируемыеПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтролируемыеПартии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПартияКонтроляКачества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьРазблокировкуТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодтвержденияКачества</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодразделениеОбработано</Name>
					<Comment>Служебный реквизит для обработчика обновления по заполнению подразделения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ЗапасыИПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыИПотребности</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаблокированоВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаблокированоПоступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КРазблокировке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладеИзЗаблокированных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступленияИзЗаблокированных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроконтролироватьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодлежитРазблокировке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгружаемыйЗаказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейЗапасыИПотребности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузкаИлиПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Comment>Дата поступления / поступления на контроль качества / отгрузки </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/КонтролируемыеПартии/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Интерпретация входных параметров.
	НаКонтроле = "1";
	Упаковка = ?(ЗначениеЗаполнено(Параметры.Упаковка), Параметры.Упаковка,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Номенклатура, "ЕдиницаИзмерения"));
	КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Упаковка, Параметры.Номенклатура);
	
	Элементы.ВНаличии.Заголовок = СтрШаблон(Элементы.ВНаличии.Заголовок, Упаковка);
	ПриИзмененииНаКонтролеСервер(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаКонтролеПриИзменении(Элемент)
	
	ПриИзмененииНаКонтролеСервер(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Параметры.Источник = "Документ.ЗаявкаНаКонтрольКачестваТоваров"
			И ЭтоЗаявка(Значение) Тогда
				СтандартнаяОбработка = Ложь;
				ТекстПредупреждения = НСтр("ru = 'В заявке на контроль качества товаров необходимо указывать контролируемые партии, по которым поступил товар. Выбор контролируемой партии, связанной с заявкой на контроль качества товаров, недоступен.'");
				ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЭтоЗаявка(Значение)
	
	УстановитьПривилегированныйРежим(Истина);
	Партия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "Партия");
	Возврат ТипЗнч(Партия) = Тип("ДокументСсылка.ЗаявкаНаКонтрольКачестваТоваров");
	
КонецФункции

&НаСервере
Процедура ПриИзмененииНаКонтролеСервер(ВызовПриСозданииФормы)
	
	ТолькоАктивные = НаКонтроле = "1";
	
	ВидимостьОстатков = Параметры.Источник = "Документ.КорректировкаНазначенияТоваров" И ТолькоАктивные;
	Элементы.ВНаличии.Видимость = ВидимостьОстатков;
	Элементы.ГруппаИтоги.Видимость = ВидимостьОстатков;
	
	Если Параметры.Источник = "Документ.КорректировкаНазначенияТоваров" Тогда
		
		Если ТолькоАктивные Тогда
			
			Текст =
				"ВЫБРАТЬ
				|	Запасы.Номенклатура КАК Номенклатура,
				|	Запасы.Характеристика КАК Характеристика,
				|	Запасы.Склад КАК Склад,
				|	Запасы.Назначение КАК Назначение,
				|	Запасы.Заказ КАК Заказ,
				|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
				|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
				|	Запасы.КРазблокировкеОстаток КАК КРазблокировкеОстаток,
				|	Запасы.РезервироватьНаСкладеИзЗаблокированныхОстаток КАК РезервироватьНаСкладеИзЗаблокированныхОстаток,
				|	Запасы.РезервироватьПоМереПоступленияИзЗаблокированныхОстаток КАК РезервироватьПоМереПоступленияИзЗаблокированныхОстаток,
				|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
				|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
				|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
				|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
				|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
				|ПОМЕСТИТЬ ЗапасыИПотребностиОстаткиКонтролируемыхПартий
				|ИЗ
				|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
				|		Номенклатура = &Номенклатура
				|			И Характеристика = &Характеристика
				|			И Склад = &Склад
				|			И Назначение = &Назначение) КАК Запасы
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура, Характеристика, Склад, Назначение
				|;
				|
				|////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Запасы.Номенклатура КАК Номенклатура,
				|	Запасы.Характеристика КАК Характеристика,
				|	Запасы.Склад КАК Склад,
				|	Запасы.Назначение КАК Назначение,
				|	Запасы.ВНаличииОстаток КАК ВНаличииОстаток,
				|	Запасы.ЗаблокированоВНаличииОстаток КАК ЗаблокированоВНаличииОстаток,
				|	Запасы.ЗаказаноОстаток КАК ЗаказаноОстаток,
				|	Запасы.ПоступитОстаток КАК ПоступитОстаток,
				|	Запасы.ЗаблокированоПоступитОстаток КАК ЗаблокированоПоступитОстаток,
				|	Запасы.РезервироватьНаСкладеОстаток КАК РезервироватьНаСкладеОстаток,
				|	Запасы.РезервироватьПоМереПоступленияОстаток КАК РезервироватьПоМереПоступленияОстаток,
				|	Запасы.ОтложитьРезервированиеОстаток КАК ОтложитьРезервированиеОстаток,
				|	Запасы.КОбеспечениюОстаток КАК КОбеспечениюОстаток,
				|	Запасы.НеОбеспечиватьОстаток КАК НеОбеспечиватьОстаток
				|ПОМЕСТИТЬ ЗапасыИПотребностиОстатки
				|ИЗ
				|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
				|		Номенклатура = &Номенклатура
				|			И Характеристика = &Характеристика
				|			И Склад = &Склад
				|			И Назначение = &Назначение) КАК Запасы
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура, Характеристика, Склад, Назначение
				|;
				|
				|////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Таблица.КонтролируемаяПартия КАК Ссылка,
				|	Таблица.КоличествоДляДействияОтгрузить КАК Излишек,
				|	ЕСТЬNULL(
				|		ВЫБОР
				|			КОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоДляДействияОтгрузить > 0
				|				ТОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоНаСкладеДляДействияРезервироватьПоМереПоступления
				|						- ОбеспечениеТоварамиПроверенногоКачества.КоличествоДляДействияОтгрузить
				|			КОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоНаСкладеДляДействияРезервироватьПоМереПоступления > 0
				|				ТОГДА ОбеспечениеТоварамиПроверенногоКачества.КоличествоНаСкладеДляДействияРезервироватьПоМереПоступления
				|			ИНАЧЕ 0
				|		КОНЕЦ, 0) КАК ДоступноПоВсемПартиям
				|ПОМЕСТИТЬ Остатки
				|ИЗ
				|	ДанныеОбеспечения КАК Таблица
				|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОбеспечения КАК ОбеспечениеТоварамиПроверенногоКачества
				|		ПО ОбеспечениеТоварамиПроверенногоКачества.Номенклатура =Таблица.Номенклатура
				|		 И ОбеспечениеТоварамиПроверенногоКачества.Характеристика = Таблица.Характеристика
				|		 И ОбеспечениеТоварамиПроверенногоКачества.Склад = Таблица.Склад
				|		 И ОбеспечениеТоварамиПроверенногоКачества.Назначение = Таблица.Назначение
				|		 И ОбеспечениеТоварамиПроверенногоКачества.КонтролируемаяПартия = ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
				|ГДЕ
				|	Таблица.КонтролируемаяПартия <> ЗНАЧЕНИЕ(Справочник.КонтролируемыеПартии.ПустаяСсылка)
				|		И Таблица.КоличествоДляДействияОтгрузить > 0
				|ИНДЕКСИРОВАТЬ ПО
				|	Ссылка
				|;
				|
				|////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	КонтролируемыеПартии.Ссылка КАК Ссылка,
				|	КонтролируемыеПартии.Наименование КАК Наименование,
				|	КонтролируемыеПартии.ПричинаБлокировкиТовара КАК ПричинаБлокировкиТовара,
				|	КонтролируемыеПартии.НомерДокументаПоступления КАК НомерДокументаПоступления,
				|	КонтролируемыеПартии.Договор КАК Договор,
				|	КонтролируемыеПартии.Партнер КАК Партнер,
				|	КонтролируемыеПартии.ДатаПоступления КАК ДатаПоступления,
				|	КонтролируемыеПартии.Партия КАК Партия,
				|	Остатки.Излишек / &КоэффициентУпаковки КАК ВНаличии,
				|	Остатки.ДоступноПоВсемПартиям / &КоэффициентУпаковки КАК ДоступноПоВсемПартиям
				|ИЗ
				|	Справочник.КонтролируемыеПартии КАК КонтролируемыеПартии
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
				|		ПО Остатки.Ссылка = КонтролируемыеПартии.Ссылка";
			
			ИменаТаблиц = ОбеспечениеВДокументахСервер.НовыеИменаТаблицДляРасчетаОстатковДляУстановкиДействий();
			ИменаТаблиц.Остатки = "ЗапасыИПотребностиОстатки"; // @query-part-1
			ИменаТаблиц.ОстаткиКонтролируемыхПартий = "ЗапасыИПотребностиОстаткиКонтролируемыхПартий"; // @query-part-1
			ИменаТаблиц.Результат = "ДанныеОбеспечения"; // @query-part-1
			ОбеспечениеВДокументахСервер.ДанныеОбеспечения(Текст, ИменаТаблиц, Ложь);
			
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			СвойстваСписка.ОсновнаяТаблица = "Справочник.КонтролируемыеПартии";
			СвойстваСписка.ДинамическоеСчитываниеДанных = Ложь;
			СвойстваСписка.ТекстЗапроса = Текст;
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
				Список,
				"Номенклатура",
				Параметры.Номенклатура);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
				Список,
				"Характеристика",
				Параметры.Характеристика);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
				Список,
				"Склад",
				Параметры.Склад);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
				Список,
				"Назначение",
				Параметры.Назначение);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
				Список,
				"КоэффициентУпаковки",
				КоэффициентУпаковки);
				
		Иначе
			
			Текст =
				"ВЫБРАТЬ
				|	КонтролируемыеПартииПереопределяемый.Ссылка КАК Ссылка,
				|	КонтролируемыеПартииПереопределяемый.Наименование КАК Наименование,
				|	КонтролируемыеПартииПереопределяемый.ПричинаБлокировкиТовара КАК ПричинаБлокировкиТовара,
				|	КонтролируемыеПартииПереопределяемый.НомерДокументаПоступления КАК НомерДокументаПоступления,
				|	КонтролируемыеПартииПереопределяемый.Договор КАК Договор,
				|	КонтролируемыеПартииПереопределяемый.Партнер КАК Партнер,
				|	КонтролируемыеПартииПереопределяемый.ДатаПоступления КАК ДатаПоступления,
				|	КонтролируемыеПартииПереопределяемый.Партия КАК Партия,
				|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15,3)) КАК ВНаличии,
				|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15,3)) КАК ДоступноПоВсемПартиям
				|ИЗ
				|	Справочник.КонтролируемыеПартии КАК КонтролируемыеПартииПереопределяемый";
				
			СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
			СвойстваСписка.ОсновнаяТаблица = "Справочник.КонтролируемыеПартии";
			СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
			СвойстваСписка.ТекстЗапроса = Текст;
			ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
			
		КонецЕсли;
		
	Иначе
		
		Если ВызовПриСозданииФормы Тогда
			
			Запрос = Новый Запрос();
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	Таблица.Заказ КАК Ссылка
				|ИЗ
				|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
				|		ТИПЗНАЧЕНИЯ(Заказ) = ТИП(Справочник.КонтролируемыеПартии)) КАК Таблица";
				
			АктивныеСсылки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			Если Параметры.Источник = "Документ.ЗаявкаНаКонтрольКачестваТоваров" Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				Запрос.УстановитьПараметр("АктивныеСсылки", АктивныеСсылки);
				Запрос.Текст =
					"ВЫБРАТЬ
					|	Таблица.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.КонтролируемыеПартии КАК Таблица
					|ГДЕ
					|	Таблица.Ссылка В(&АктивныеСсылки)
					|		И ТИПЗНАЧЕНИЯ(Таблица.Партия) <> ТИП(Документ.ЗаявкаНаКонтрольКачестваТоваров)";
				АктивныеСсылки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
				УстановитьПривилегированныйРежим(Ложь);
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Ссылки", АктивныеСсылки);
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТолькоАктивные", ТолькоАктивные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
